cmsis-svd/cmsis-svd/data/NXP/LPC11E6x_v0.8.xml
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PWMC</name>																	
		<description>PWM Control Register. The PWMCON enables PWM mode for the external match pins CT16B0_MAT[1:0] and CT16B1_MAT[1:0].</description>																	
		<addressOffset>0x074</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>PWMEN0</name>															
				<description>PWM mode enable for channel0.</description>															
				<bitRange>[0:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>EM0</name>													
						<description>CT16Bn_MAT0 is controlled by EM0.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PWM</name>													
						<description>PWM mode is enabled for CT16Bn_MAT0.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PWMEN1</name>															
				<description>PWM mode enable for channel1.</description>															
				<bitRange>[1:1]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>EM1</name>													
						<description>CT16Bn_MAT01 is controlled by EM1.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PWM</name>													
						<description>PWM mode is enabled for CT16Bn_MAT1.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PWMEN2</name>															
				<description>PWM mode enable for channel2.</description>															
				<bitRange>[2:2]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>EM2</name>													
						<description>CT16Bn_MAT2 is controlled by EM2.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PWM</name>													
						<description>PWM mode is enabled for CT16Bn_MAT2.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PWMEN3</name>															
				<description>PWM mode enable for channel3.</description>															
				<bitRange>[3:3]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>EM3</name>													
						<description>CT16Bn_MAT3 is controlled by EM3.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PWM</name>													
						<description>PWM mode is enabled for CT16Bn_MAT3.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[31:4]</bitRange>															
														
			</field>																
		</fields>																	
	</register>																		
</registers>																			
						
																							

		</peripheral>
		
		<peripheral derivedFrom="CT16B0">
			<name>CT16B1</name>
			<description>16-bit counter/timers CT16B1</description>
			<baseAddress>0x40010000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CT16B1</name>
				<value>17</value>
			</interrupt>
									

		</peripheral>
		
		<peripheral>
			<name>CT32B0</name>
			<description>32-bit counter/timers CT32B0</description>
			<groupName>CT32B0</groupName>
			<baseAddress>0x40014000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CT32B0</name>
				<value>18</value>
			</interrupt>
			<registers>																				
	<register>																			
		<name>IR</name>																		
		<description>Interrupt Register. The IR can be written to clear interrupts. The IR can be read to identify which of eight possible interrupt sources are pending.</description>																		
		<addressOffset>0x000</addressOffset>																		
		<access>read-write</access>																		
		<resetValue>0</resetValue>																		
		<resetMask>0xFFFFFFFF</resetMask>																		
		<fields>																		
			<field>																	
				<name>MR0INT</name>																
				<description>Interrupt flag for match channel 0.</description>																
				<bitRange>[0:0]</bitRange>																
			</field>																	
			<field>																	
				<name>MR1INT</name>																
				<description>Interrupt flag for match channel 1.</description>																
				<bitRange>[1:1]</bitRange>																
			</field>																	
			<field>																	
				<name>MR2INT</name>																
				<description>Interrupt flag for match channel 2.</description>																
				<bitRange>[2:2]</bitRange>																
			</field>																	
			<field>																	
				<name>MR3INT</name>																
				<description>Interrupt flag for match channel 3.</description>																
				<bitRange>[3:3]</bitRange>																
			</field>																	
			<field>																	
				<name>CR0INT</name>																
				<description>Interrupt flag for capture channel 0 event.</description>																
				<bitRange>[4:4]</bitRange>																
			</field>																	
			<field>																	
				<name>CR1INT</name>																
				<description>Interrupt flag for capture channel 1 event.</description>																
				<bitRange>[5:5]</bitRange>																
			</field>																	
			<field>																	
				<name>CR2INT</name>																
				<description>Interrupt flag for capture channel 2 event.</description>																
				<bitRange>[6:6]</bitRange>																
			</field>																	
			<field>																	
				<name>RESERVED</name>																
				<description>Reserved</description>																
				<bitRange>[31:7]</bitRange>																
			</field>																	
		</fields>																		
	</register>																			
	<register>																			
		<name>TCR</name>																		
		<description>Timer Control Register. The TCR is used to control the Timer Counter functions. The Timer Counter can be disabled or reset through the TCR.</description>																		
		<addressOffset>0x004</addressOffset>																		
		<access>read-write</access>																		
		<resetValue>0</resetValue>																		
		<resetMask>0xFFFFFFFF</resetMask>																		
		<fields>																		
			<field>																	
				<name>CEN</name>																
				<description>Counter enable.</description>																
				<bitRange>[0:0]</bitRange>																
				<enumeratedValues>																
				<name>ENUM</name>																
					<enumeratedValue>															
						<name>DISABLED</name>														
						<description>The counters are disabled.</description>														
						<value>0</value>														
					</enumeratedValue>															
					<enumeratedValue>															
						<name>ENABLED</name>														
						<description>The Timer Counter and Prescale Counter are enabled for counting.</description>														
						<value>1</value>														
					</enumeratedValue>															
				</enumeratedValues>																
			</field>																	
			<field>																	
				<name>CRST</name>																
				<description>Counter reset.</description>																
				<bitRange>[1:1]</bitRange>																
				<enumeratedValues>																
				<name>ENUM</name>																
					<enumeratedValue>															
						<name>NOP</name>														
						<description>Do nothing.</description>														
						<value>0</value>														
					</enumeratedValue>															
					<enumeratedValue>															
						<name>RESET</name>														
						<description>The Timer Counter and the Prescale Counter are synchronously reset on the next positive edge of PCLK. The counters remain reset until TCR[1] is returned to zero.</description>														
						<value>1</value>														
					</enumeratedValue>															
				</enumeratedValues>																
			</field>																	
			<field>																	
				<name>RESERVED</name>																
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>																
				<bitRange>[31:2]</bitRange>																
															
