cmsis-svd/cmsis-svd/data/NXP/LPC11E6x_v0.8.xml
		<register>
			<name>THR1_HIGH</name>
			<description>A/D High Compare Threshold Register 1: Contains the upper threshold level for automatic threshold comparison for any channels linked to threshold pair 1.</description>
			<addressOffset>0x05C</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>THRHIGH</name>
					<description>High threshold value against which A/D results will be compared</description>
					<bitRange>[15:4]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CHAN_THRSEL</name>
			<description>A/D Channel-Threshold Select Register. Specifies which set of threshold compare registers are to be used for each channel</description>
			<addressOffset>0x060</addressOffset>
			<access>read-only</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CH0_THRSEL</name>
					<description>Threshold select by channel.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THRESHOLD_0</name>
							<description>Threshold 0. Channel 0 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THRESHOLD_1</name>
							<description>Threshold 1. Channel 0 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CH1_THRSEL</name>
					<description>Threshold select by channel.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THRESHOLD_0</name>
							<description>Threshold 0. Channel 1 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THRESHOLD_1</name>
							<description>Threshold 1. Channel 1 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CH2_THRSEL</name>
					<description>Threshold select by channel.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THRESHOLD_0</name>
							<description>Threshold 0. Channel 2 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THRESHOLD_1</name>
							<description>Threshold 1. Channel 2 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CH3_THRSEL</name>
					<description>Threshold select by channel.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THRESHOLD_0</name>
							<description>Threshold 0. Channel 3 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THRESHOLD_1</name>
							<description>Threshold 1. Channel 3 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CH4_THRSEL</name>
					<description>Threshold select by channel.</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THRESHOLD_0</name>
							<description>Threshold 0. Channel 4 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THRESHOLD_1</name>
							<description>Threshold 1. Channel 4 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CH5_THRSEL</name>
					<description>Threshold select by channel.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THRESHOLD_0</name>
							<description>Threshold 0. Channel 5 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THRESHOLD_1</name>
							<description>Threshold 1. Channel 5 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CH6_THRSEL</name>
					<description>Threshold select by channel.</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THRESHOLD_0</name>
							<description>Threshold 0. Channel 6 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THRESHOLD_1</name>
							<description>Threshold 1. Channel 6 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CH7_THRSEL</name>
					<description>Threshold select by channel.</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THRESHOLD_0</name>
							<description>Threshold 0. Channel 7 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THRESHOLD_1</name>
							<description>Threshold 1. Channel 7 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CH8_THRSEL</name>
					<description>Threshold select by channel.</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THRESHOLD_0</name>
							<description>Threshold 0. Channel 8 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THRESHOLD_1</name>
							<description>Threshold 1. Channel 8 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CH9_THRSEL</name>
					<description>Threshold select by channel.</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THRESHOLD_0</name>
							<description>Threshold 0. Channel 9 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THRESHOLD_1</name>
							<description>Threshold 1. Channel 9 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CH10_THRSEL</name>
					<description>Threshold select by channel.</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THRESHOLD_0</name>
							<description>Threshold 0. Channel 10 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THRESHOLD_1</name>
							<description>Threshold 1. Channel 10 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CH11_THRSEL</name>
					<description>Threshold select by channel.</description>
					<bitRange>[11:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>THRESHOLD_0</name>
							<description>Threshold 0. Channel 11 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THRESHOLD_1</name>
							<description>Threshold 1. Channel 11 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
			</fields>
		</register>
		<register>
			<name>INTEN</name>
			<description>A/D Interrupt Enable Register. This register contains enable bits that enable the sequence-A, sequence-B, threshold compare and data overrun interrupts to be generated.</description>
			<addressOffset>0x064</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SEQA_INTEN</name>
					<description>Sequence A interrupt enable.</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled. The sequence A interrupt/DMA request is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled. The sequence A interrupt/DMA request is enabled and will be asserted either upon completion of each individual conversion performed as part of sequence A, or upon completion of the entire A sequence of conversions, depending on the MODE bit in the SEQA_CTRL register.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>SEQB_INTEN</name>
					<description>Sequence B interrupt enable.</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled. The sequence B interrupt/DMA request is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled. The sequence B interrupt/DMA request is enabled and will be asserted either upon completion of each individual conversion performed as part of sequence B, or upon completion of the entire B sequence of conversions, depending on the MODE bit in the SEQB_CTRL register.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>OVR_INTEN</name>
					<description>Overrun interrupt enable.</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled. The overrun interrupt is disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLED</name>
							<description>Enabled. The overrun interrupt is enabled. Detection of an overrun condition on any of the 12 channel data registers will cause an overrun interrupt request. In addition, if the MODE bit for a particular sequence is 0, then an overrun in the global data register for that sequence will also cause this interrupt request to be asserted.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ADCMPINTEN0</name>
					<description>Threshold comparison interrupt enable.</description>
					<bitRange>[4:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OUTSIDE_THRESHOLD</name>
							<description>Outside threshold.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CROSSING_THRESHOLD</name>
							<description>Crossing threshold.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ADCMPINTEN1</name>
					<description>Threshold comparison interrupt enable.</description>
					<bitRange>[6:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OUTSIDE_THRESHOLD</name>
							<description>Outside threshold.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CROSSING_THRESHOLD</name>
							<description>Crossing threshold.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ADCMPINTEN2</name>
					<description>Threshold comparison interrupt enable.</description>
					<bitRange>[8:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OUTSIDE_THRESHOLD</name>
							<description>Outside threshold.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CROSSING_THRESHOLD</name>
							<description>Crossing threshold.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ADCMPINTEN3</name>
					<description>Threshold comparison interrupt enable.</description>
					<bitRange>[10:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OUTSIDE_THRESHOLD</name>
							<description>Outside threshold.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CROSSING_THRESHOLD</name>
							<description>Crossing threshold.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ADCMPINTEN4</name>
					<description>Threshold comparison interrupt enable.</description>
					<bitRange>[12:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OUTSIDE_THRESHOLD</name>
							<description>Outside threshold.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CROSSING_THRESHOLD</name>
							<description>Crossing threshold.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ADCMPINTEN5</name>
					<description>Threshold comparison interrupt enable.</description>
					<bitRange>[14:13]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OUTSIDE_THRESHOLD</name>
							<description>Outside threshold.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CROSSING_THRESHOLD</name>
							<description>Crossing threshold.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ADCMPINTEN6</name>
					<description>Threshold comparison interrupt enable.</description>
					<bitRange>[16:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OUTSIDE_THRESHOLD</name>
							<description>Outside threshold.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CROSSING_THRESHOLD</name>
							<description>Crossing threshold.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ADCMPINTEN7</name>
					<description>Threshold comparison interrupt enable.</description>
					<bitRange>[18:17]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OUTSIDE_THRESHOLD</name>
							<description>Outside threshold.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CROSSING_THRESHOLD</name>
							<description>Crossing threshold.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ADCMPINTEN8</name>
					<description>Threshold comparison interrupt enable.</description>
					<bitRange>[20:19]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OUTSIDE_THRESHOLD</name>
							<description>Outside threshold.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CROSSING_THRESHOLD</name>
							<description>Crossing threshold.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ADCMPINTEN9</name>
					<description>Threshold comparison interrupt enable.</description>
					<bitRange>[22:21]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OUTSIDE_THRESHOLD</name>
							<description>Outside threshold.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CROSSING_THRESHOLD</name>
							<description>Crossing threshold.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ADCMPINTEN10</name>
					<description>Threshold comparison interrupt enable.</description>
					<bitRange>[24:23]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OUTSIDE_THRESHOLD</name>
							<description>Outside threshold.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CROSSING_THRESHOLD</name>
							<description>Crossing threshold.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>ADCMPINTEN11</name>
					<description>Threshold comparison interrupt enable.</description>
					<bitRange>[26:25]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OUTSIDE_THRESHOLD</name>
							<description>Outside threshold.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>CROSSING_THRESHOLD</name>
							<description>Crossing threshold.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:27]</bitRange>

