cmsis-svd/cmsis-svd/data/NXP/LPC11E6x_v0.8.xml
				</field>
			</fields>
		</register>
		<register>													
			<name>PIO0_4</name>												
			<description>I/O configuration for open-drain pin PIO0_4</description>												
			<addressOffset>0x010</addressOffset>												
			<access>read-write</access>												
			<resetValue>0x00000080</resetValue>												
			<resetMask>0xFFFFFFFF</resetMask>												
			<fields>												
				<field>											
					<name>FUNC</name>										
					<description>Selects pin function. </description>										
					<bitRange>[2:0]</bitRange>										
													
				</field>											
				<field>											
					<name>RESERVED</name>										
					<description>Reserved.</description>										
					<bitRange>[7:3]</bitRange>										
					
				</field>											
				<field>											
					<name>I2CMODE</name>										
					<description>Selects I2C mode (see  Section 7.3.8).  Select Standard mode (I2CMODE = 00, default) or Standard I/O functionality (I2CMODE = 01) if the pin function is GPIO (FUNC = 000).</description>										
					<bitRange>[9:8]</bitRange>										
					<enumeratedValues>										
						<name>ENUM</name>										
						<enumeratedValue>									
							<name>STANDARD_MODE_FAST</name>								
							<description>Standard mode/ Fast-mode I2C.</description>								
							<value>0x0</value>								
						</enumeratedValue>									
						<enumeratedValue>									
							<name>STANDARD_IO_FUNCTIO</name>								
							<description>Standard I/O functionality</description>								
							<value>0x1</value>								
						</enumeratedValue>									
						<enumeratedValue>									
							<name>FAST_MODE_PLUS_I2C</name>								
							<description>Fast-mode Plus I2C</description>								
							<value>0x2</value>								
						</enumeratedValue>									
						<enumeratedValue>									
							<name>RESERVED</name>								
							<description>Reserved.</description>								
							<value>0x3</value>								
						</enumeratedValue>									
					</enumeratedValues>										
				</field>											
				<field>											
					<name>RESERVED</name>										
					<description>Reserved.</description>										
					<bitRange>[31:10]</bitRange>										
					
				</field>											
			</fields>												
		</register>
		<register>													
			<name>PIO0_5</name>												
			<description>I/O configuration for open-drain pin PIO0_5</description>												
			<addressOffset>0x014</addressOffset>												
			<access>read-write</access>												
			<resetValue>0x00000080</resetValue>												
			<resetMask>0xFFFFFFFF</resetMask>												
			<fields>												
				<field>											
					<name>FUNC</name>										
					<description>Selects pin function. </description>										
					<bitRange>[2:0]</bitRange>										
											
				</field>											
				<field>											
					<name>RESERVED</name>										
					<description>Reserved.</description>										
					<bitRange>[7:3]</bitRange>										
					
				</field>											
				<field>											
					<name>I2CMODE</name>										
					<description>Selects I2C mode (see  Section 7.3.8).  Select Standard mode (I2CMODE = 00, default) or Standard I/O functionality (I2CMODE = 01) if the pin function is GPIO (FUNC = 000).</description>										
					<bitRange>[9:8]</bitRange>										
					<enumeratedValues>										
						<name>ENUM</name>										
						<enumeratedValue>									
							<name>STANDARD_MODE_FAST</name>								
							<description>Standard mode/ Fast-mode I2C.</description>								
							<value>0x0</value>								
						</enumeratedValue>									
						<enumeratedValue>									
							<name>STANDARD_IO_FUNCTIO</name>								
							<description>Standard I/O functionality</description>								
							<value>0x1</value>								
						</enumeratedValue>									
						<enumeratedValue>									
							<name>FAST_MODE_PLUS_I2C</name>								
							<description>Fast-mode Plus I2C</description>								
							<value>0x2</value>								
						</enumeratedValue>									
						<enumeratedValue>									
							<name>RESERVED</name>								
							<description>Reserved.</description>								
							<value>0x3</value>								
						</enumeratedValue>									
					</enumeratedValues>										
				</field>											
				<field>											
					<name>RESERVED</name>										
					<description>Reserved.</description>										
					<bitRange>[31:10]</bitRange>										
					
				</field>											
			</fields>												
		</register>
		<register>
			<dim>18</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>6-23</dimIndex>
			<name>PIO0_%s</name>
			<description>I/O configuration for  port PIO0</description>
			<addressOffset>0x018</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000090</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FUNC</name>
					<description>Selects pin function.</description>
					<bitRange>[2:0]</bitRange>
					
				</field>
				<field>
					<name>MODE</name>
					<description>Selects function mode (on-chip pull-up/pull-down resistor control).</description>
					<bitRange>[4:3]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>INACTIVE_NO_PULL_DO</name>
							<description>Inactive (no pull-down/pull-up resistor enabled).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_DOWN_RESISTOR_E</name>
							<description>Pull-down resistor enabled.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>PULL_UP_RESISTOR_ENA</name>
							<description>Pull-up resistor enabled.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>REPEATER_MODE</name>
							<description>Repeater mode.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>HYS</name>
					<description>Hysteresis.</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>INV</name>
					<description>Invert input</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>INPUT_NOT_INVERTED</name>
							<description>Input not inverted (HIGH on pin reads as 1; LOW on pin reads as 0).</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INPUT_INVERTED_HIGH</name>
							<description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as 1).</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[9:7]</bitRange>
					
