cmsis-svd/cmsis-svd/data/NXP/LPC11E6x_v0.8.xml
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PRESETCTRL</name>																	
		<description>Peripheral reset control</description>																	
		<addressOffset>0x004</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>SSP0_RST_N</name>															
				<description>SSP0 reset control</description>															
				<bitRange>[0:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the SSP0 peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. SSP0 reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>I2C0_RST_N</name>															
				<description>I2C0 reset control</description>															
				<bitRange>[1:1]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the I2C0 peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. I2C0 reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>SSP1_RST_N</name>															
				<description>SSP1 reset control</description>															
				<bitRange>[2:2]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the SSP1 peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. SSP1 reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>I2C1_RST_N</name>															
				<description>I2C1 reset control</description>															
				<bitRange>[3:3]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the I2C1 peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. I2C1 reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>FRG_RST_N</name>															
				<description>FRG reset control</description>															
				<bitRange>[4:4]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the FRG peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. FRG reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>USART1_RST_N</name>															
				<description>USART1 reset control</description>															
				<bitRange>[5:5]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the USART1 peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. USART1 reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>USART2_RST_N</name>															
				<description>USART2 reset control</description>															
				<bitRange>[6:6]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the USART2 peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. USART2 reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>USART3_RST_N</name>															
				<description>USART3 reset control</description>															
				<bitRange>[7:7]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the USART3 peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. USART3 reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>USART4_RST_N</name>															
				<description>USART4 reset control</description>															
				<bitRange>[8:8]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the USART4 peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. USART4 reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>SCT0_RST_N</name>															
				<description>SCT0 reset control</description>															
				<bitRange>[9:9]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the SCT0 peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. SCT0 reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>SCT1_RST_N</name>															
				<description>SCT1 reset control</description>															
				<bitRange>[10:10]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>RESET</name>													
						<description>Reset. Resets the SCT1 peripheral.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CLEAR_RESET</name>													
						<description>Clear reset. SCT1 reset de-asserted.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:11]</bitRange>															
														
