cmsis-svd/cmsis-svd/data/NXP/LPC11E6x_v0.8.xml
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>STARTERP1</name>																	
		<description>Start logic 1 interrupt wake-up enable register 1</description>																	
		<addressOffset>0x214</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>RTCINT</name>															
				<description>RTC interrupt wake-up</description>															
				<bitRange>[12:12]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLED</name>													
						<description>Enabled</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>WWDT_BODINT</name>															
				<description>Combined WWDT interrupt or Brown Out Detect (BOD) interrupt wake-up</description>															
				<bitRange>[13:13]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLED</name>													
						<description>Enabled</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[18:14]</bitRange>															
														
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[19:19]</bitRange>															
																	
			</field>																
			<field>																
				<name>GROUP0INT</name>															
				<description>GPIO GROUP0 interrupt wake-up</description>															
				<bitRange>[20:20]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLED</name>													
						<description>Enabled</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>GROUP1INT</name>															
				<description>GPIO GROUP1 interrupt wake-up</description>															
				<bitRange>[21:21]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLED</name>													
						<description>Enabled</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[22:22]</bitRange>															
														
			</field>																
			<field>																
				<name>USART1_4</name>															
				<description>Combined USART1 and USART4 interrupt wake-up</description>															
				<bitRange>[23:23]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLED</name>													
						<description>Enabled</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>USART2_3</name>															
				<description>Combined USART2 and USART3 interrupt wake-up</description>															
				<bitRange>[24:24]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENABLED</name>													
						<description>Enabled</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PDSLEEPCFG</name>																	
		<description>Power-down states in deep-sleep mode</description>																	
		<addressOffset>0x230</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0x00000000</resetMask>																	
		<fields>																	
			<field>																
				<name>BOD_PD</name>															
				<description>BOD power-down control for Deep-sleep and Power-down mode</description>															
				<bitRange>[3:3]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>POWERED_DOWN</name>													
						<description>Powered down</description>													
						<value>1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POWERED</name>													
						<description>Powered</description>													
						<value>0</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[5:4]</bitRange>															
														
