cmsis-svd/cmsis-svd/data/NXP/LPC11E6x_v0.8.xml
			</field>																
			<field>																
				<name>WDTOSC_PD</name>															
				<description>Watchdog oscillator power-down control for Deep-sleep and Power-down mode</description>															
				<bitRange>[6:6]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>POWERED_DOWN</name>													
						<description>Powered down</description>													
						<value>1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POWERED</name>													
						<description>Powered</description>													
						<value>0</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:7]</bitRange>															
																			
																			
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PDAWAKECFG</name>																	
		<description>Power-down states for wake-up from deep-sleep</description>																	
		<addressOffset>0x234</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0x00000000</resetMask>																	
		<fields>																	
			<field>																
				<name>IRCOUT_PD</name>															
				<description>IRC oscillator output wake-up configuration</description>															
				<bitRange>[0:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>POWERED_DOWN</name>													
						<description>Powered down</description>													
						<value>1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POWERED</name>													
						<description>Powered</description>													
						<value>0</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>IRC_PD</name>															
				<description>IRC oscillator power-down wake-up configuration</description>															
				<bitRange>[1:1]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>POWERED_DOWN</name>													
						<description>Powered down</description>													
						<value>1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POWERED</name>													
						<description>Powered</description>													
						<value>0</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>FLASH_PD</name>															
				<description>Flash wake-up configuration</description>															
				<bitRange>[2:2]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>POWERED_DOWN</name>													
						<description>Powered down</description>													
						<value>1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POWERED</name>													
						<description>Powered</description>													
						<value>0</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>BOD_PD</name>															
				<description>BOD wake-up configuration</description>															
				<bitRange>[3:3]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>POWERED_DOWN</name>													
						<description>Powered down</description>													
						<value>1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POWERED</name>													
						<description>Powered</description>													
						<value>0</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>ADC_PD</name>															
				<description>ADC wake-up configuration</description>															
				<bitRange>[4:4]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>POWERED_DOWN</name>													
						<description>Powered down</description>													
						<value>1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POWERED</name>													
						<description>Powered</description>													
						<value>0</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>SYSOSC_PD</name>															
				<description>Crystal oscillator wake-up configuration</description>															
				<bitRange>[5:5]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>POWERED_DOWN</name>													
						<description>Powered down</description>													
						<value>1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POWERED</name>													
						<description>Powered</description>													
						<value>0</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>WDTOSC_PD</name>															
				<description>Watchdog oscillator wake-up configuration</description>															
				<bitRange>[6:6]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>POWERED_DOWN</name>													
						<description>Powered down</description>													
						<value>1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POWERED</name>													
						<description>Powered</description>													
						<value>0</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>SYSPLL_PD</name>															
				<description>System PLL wake-up configuration</description>															
				<bitRange>[7:7]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>POWERED_DOWN</name>													
						<description>Powered down</description>													
						<value>1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POWERED</name>													
						<description>Powered</description>													
						<value>0</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>																
				<bitRange>[8:8]</bitRange>															
																	
