cmsis-svd/cmsis-svd/data/NXP/LPC11E6x_v0.8.xml
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved. Always write this bit as 0.</description>															
				<bitRange>[9:9]</bitRange>															
														
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>														
				<bitRange>[10:10]</bitRange>															
																		
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved. This bit must be set to one in Run mode.</description>															
				<bitRange>[11:11]</bitRange>															
																			
															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[12:12]</bitRange>															
																			
															
			</field>																
			<field>																
				<name>TEMPSENSE_PD</name>															
				<description>Temperature sensor wake-up configuration</description>															
				<bitRange>[13:13]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>POWERED</name>													
						<description>Powered</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POWERED_DOWN</name>													
						<description>Powered down</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:14]</bitRange>															
																			
																		
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PDRUNCFG</name>																	
		<description>Power configuration register</description>																	
		<addressOffset>0x238</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0x00000000</resetMask>																	
		<fields>																	
			<field>																
				<name>IRCOUT_PD</name>															
				<description>IRC oscillator output power-down</description>															
				<bitRange>[0:0]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>POWERED</name>													
						<description>Powered</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POWERED_DOWN</name>													
						<description>Powered down</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>IRC_PD</name>															
				<description>IRC oscillator power-down</description>															
				<bitRange>[1:1]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>POWERED</name>													
						<description>Powered</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POWERED_DOWN</name>													
						<description>Powered down</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>FLASH_PD</name>															
				<description>Flash power-down</description>															
				<bitRange>[2:2]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>POWERED</name>													
						<description>Powered</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POWERED_DOWN</name>													
						<description>Powered down</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>BOD_PD</name>															
				<description>BOD power-down</description>															
				<bitRange>[3:3]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>POWERED</name>													
						<description>Powered</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POWERED_DOWN</name>													
						<description>Powered down</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>ADC_PD</name>															
				<description>ADC power-down</description>															
				<bitRange>[4:4]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>POWERED</name>													
						<description>Powered</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POWERED_DOWN</name>													
						<description>Powered down</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>SYSOSC_PD</name>															
				<description>Crystal oscillator power-down. After power-up, add a software delay of approximately 500 us before using.</description>															
				<bitRange>[5:5]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>POWERED</name>													
						<description>Powered</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POWERED_DOWN</name>													
						<description>Powered down</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>WDTOSC_PD</name>															
				<description>Watchdog oscillator power-down</description>															
				<bitRange>[6:6]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>POWERED</name>													
						<description>Powered</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POWERED_DOWN</name>													
						<description>Powered down</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>SYSPLL_PD</name>															
				<description>System PLL power-down</description>															
				<bitRange>[7:7]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>POWERED</name>													
						<description>Powered</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>POWERED_DOWN</name>													
						<description>Powered down</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[8:8]</bitRange>															
																			
															
