cmsis-svd/cmsis-svd/data/NXP/LPC11E6x_v0.8.xml
			</field>									
		</fields>										
	</register>											
	<register>											
		<name>CTL</name>										
		<description>USART Control register. USART control settings that are more likely to change during operation.</description>										
		<addressOffset>0x004</addressOffset>										
		<access>read-write</access>										
		<resetValue>0</resetValue>										
		<resetMask>0xFFFFFFFF</resetMask>										
		<fields>										
			<field>									
				<name>RESERVED</name>								
				<description>Reserved. Read value is undefined, only zero should be written.</description>								
				<bitRange>[0:0]</bitRange>								
							
			</field>									
			<field>									
				<name>TXBRKEN</name>								
				<description>Break Enable.</description>								
				<bitRange>[1:1]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>NORMAL_OPERATION</name>						
						<description>Normal operation.</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>CONTINUOUS_BREAK_IS</name>						
						<description>Continuous break is sent immediately when this bit is set, and remains until this bit is cleared. A break may be sent without danger of corrupting any currently transmitting character if the transmitter is first disabled (TXDIS in CTL is set) and then waiting for the transmitter to be disabled (TXDISINT in STAT = 1) before writing 1 to TXBRKEN.</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>ADDRDET</name>								
				<description>Enable address detect mode.</description>								
				<bitRange>[2:2]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>DISABLED</name>						
						<description>Disabled. The USART presents all incoming data.</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ENABLED</name>						
						<description>Enabled. The USART receiver ignores incoming data that does not have the most significant bit of the data (typically the 9th bit) = 1. When the data MSB bit = 1, the receiver treats the incoming data normally, generating a received data interrupt. Software can then check the data to see if this is an address that should be handled. If it is, the ADDRDET bit is cleared by software and further incoming data is handled normally.</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved. Read value is undefined, only zero should be written.</description>								
				<bitRange>[5:3]</bitRange>								
							
			</field>									
			<field>									
				<name>TXDIS</name>								
				<description>Transmit Disable.</description>								
				<bitRange>[6:6]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>NOT_DISABLED</name>						
						<description>Not disabled. USART transmitter is not disabled.</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>DISABLED</name>						
						<description>Disabled. USART transmitter is disabled after any character currently being transmitted is complete. This feature can be used to facilitate software flow control.</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved. Read value is undefined, only zero should be written.</description>								
				<bitRange>[7:7]</bitRange>								
							
			</field>									
			<field>									
				<name>CC</name>								
				<description>Continuous Clock generation. By default, SCLK is only output while data is being transmitted in synchronous mode.</description>								
				<bitRange>[8:8]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>CLOCK_ON_CHARACTER</name>						
						<description>Clock on character. In synchronous mode, SCLK cycles only when characters are being sent on Un_TXD or to complete a character that is being received.</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>CONTINUOUS_CLOCK</name>						
						<description>Continuous clock. SCLK runs continuously in synchronous mode, allowing characters to be received on Un_RxD independently from transmission on Un_TXD).</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>CLRCCONRX</name>								
				<description>Clear Continuous Clock.</description>								
				<bitRange>[9:9]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>NO_EFFECT</name>						
						<description>No effect on the CC bit.</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>AUTO_CLEAR</name>						
						<description>Auto-clear. The CC bit is automatically cleared when a complete character has been received. This bit is cleared at the same time.</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved. Read value is undefined, only zero should be written.</description>								
				<bitRange>[15:10]</bitRange>								
							
			</field>									
			<field>									
				<name>AUTOBAUD</name>								
				<description>Autobaud enable.</description>								
				<bitRange>[16:16]</bitRange>								
				<enumeratedValues>								
				<name>ENUM</name>								
					<enumeratedValue>							
						<name>DISABLED</name>						
						<description>Disabled. UART is in normal operating mode.</description>						
						<value>0</value>						
					</enumeratedValue>							
					<enumeratedValue>							
						<name>ENABLED</name>						
						<description>Enabled. UART is in autobaud mode. This bit should only be set when the UART receiver is idle. The first start bit of RX is measured and used the update the BRG register to match the received data rate. AUTOBAUD is cleared once this process is complete, or if there is an AERR. This bit can be cleared by software when set, but only when the UART receiver is idle.</description>						
						<value>1</value>						
					</enumeratedValue>							
				</enumeratedValues>								
			</field>									
			<field>									
				<name>RESERVED</name>								
				<description>Reserved. Read value is undefined, only zero should be written.</description>								
				<bitRange>[31:17]</bitRange>								
							
